-- 1. 테이블 test11를 생성하기. 
--    컬럼은 정수형인 no 가 기본키로 
--    name 문자형 20자리
--    tel 문자형 20 자리
--   addr 문자형 100자리로 기본값을 서울시 금천구로 설정하기
​
-- 2. 교수 테이블로 부터 102 학과 교수들의 
-- 번호, 이름, 학과코드, 급여, 보너스, 직급만을 컬럼으로
-- 가지는 professor_102 테이블을 생성하기
​
-- 3. 교수 테이블에서 이상미교수와 같은 직급의 교수를 퇴직시키기

-- 4.교수번호,교수이름,직급, 학과코드,학과명 컬럼을 가진 테이블 professor_201을 생성하여
--     201학과에 속한 교수들의 정보를 저장하기

-- 5. 사원테이블에 사원번호:3001, 이름:홍길동, 직책:사외이사, 
--   급여:100, 부서:10, 입사일:오늘인 레코드 등록하기 -> 컬럼명 지정

-- 6. 사원테이블에 사원번호:3002, 이름:홍길동, 직책:사외이사, 
--   급여:100, 부서:10, 입사일:오늘인 레코드 등록하기 -> 컬럼명 지정안함

-- 7. student 테이블과 같은 컬럼을 가진 테이블 stud_male 테이블 생성하기.
--     student 데이터 중 남학생 정보만 stud_male 테이블에 저장하기
--    성별은 주민번호를 기준으로 한다.

-- 8.  2학년 학생의 학번,이름, 국어,영어,수학 값을 가지는 score2 테이블 생성하기

-- 9. 박인숙 교수와 같은 조건으로 오늘 입사한 이몽룡 교수 추가하기
--    교수번호 : 6003,이름:이몽룡,입사일:오늘,id:monglee
--    나머지 부분은 박인숙 교수 정보와 같다.

-- 10. major 테이블에서 code값이 200 이상인 데이터만 major2에 데이터 추가하기

-- 11. major 테이블에서  major2 테이블에 공과대학에 속한 학과 정보만 추가하기

-- 12. 이영국 직원과 같은 직급의 직원의 급여는 
--    박진택 직원의 같은 부서의 평균급여의 80%로 변경하고, 보너스는 현재 보너스보다 15%를 인상하여 변경하기

-- 13. student 테이블과 같은 컬럼과, 학생 중 남학생의 정보만을 가지는  v_stud_male 뷰 생성하기.
--    성별은 주민번호를 기준으로 한다.

-- 14.  교수번호,이름,부서코드,부서명,자기부서의 최대급여,최소급여,,평균급여, 최대보너스,최소보너스, 평균보너스 조회하기
--       보너스가 없으면 0으로 처리한다.